using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace task4
{
    class Program
    {
        // Задание 4. Написать метод принимающий некоторое количесво чисел, выяснить
        // является заданная последовательность элементами арифметической или геометрической прогрессии
        // 
        // Примечание
        //             http://ru.wikipedia.org/wiki/Арифметическая_прогрессия
        //             http://ru.wikipedia.org/wiki/Геометрическая_прогрессия

        static void Main(string[] args)
        {
            int[] arr = { 1, 3, 5, 7, 8 };
            Console.WriteLine(CheckNumbers(arr)); //вывод результата проверки в консоль
            Console.ReadKey();
        }

        /// <summary>
        /// проверка числовой последовательности на принадлежность к арифметической или геометрической прогрессии
        /// </summary>
        /// <param name="n"></param>
        /// <returns></returns>
        static string CheckNumbers(params int[] n)  //возвращает результат проверки в виде строки
        {
            bool a = false, //результат проверки арифметической прогрессии
                 g = false; //результат проверки геометрической прогрессии

            int d = n[1] - n[0]; //шаг прогрессии
            for (int i = 1; i < n.Length; i++)  //проверка на арифметическую прогрессию
            {
                if (n[i] == n[i - 1] + d)   //пошаговая проверка равенства текущего элемента к предыдущему элементу + шаг прогрессии
                {
                    if (i == n.GetUpperBound(0))    //если условие проверки выполнено для последнего элемента в последовательности
                    {
                        a = true;
                    }
                    continue;
                }
                else //отрицательный результат проверки на арифметическую прогрессию и выход из цикла проверки
                {
                    break;
                }
            }

            int q = n[1] / n[0]; //знаменатель прогрессии
            for (int i = 1; i < n.Length; i++)  //проверка на геометрическую прогрессию
            {
                if (n[i] == n[i - 1] * q)   //пошаговая проверка равенства текущего элемента к предыдущему элементу * знаменатель прогрессии
                {
                    if (i == n.GetUpperBound(0))  //если условие проверки выполнено для последнего элемента в последовательности  
                    {
                        g = true;
                    }
                    continue;
                }
                else //отрицательный результат проверки на геометрическую прогрессию и выход из цикла проверки
                {
                    break;
                }
            }

            return a ? "Является арифметической прогрессией" : g ? "Является геометричской прогрессией" : "Не является прогрессией"; //возвращает из методастроку результата проверки
        }
    }
}
